{
  "navbar": {
    "home": "Home",
    "aboutMe": "About Me",
    "projects": "Projects",
    "technologies": "Technologies",
    "contact": "Contact"
  },
  "home": {
    "shortDescription": "My name is Marcin Migdał. I'm a graduate of Państwowa Wyższa Szkoła Zawodowa W Tarnowie.",
    "downLoadButton": "Download CV"
  },
  "aboutMe": "From July 2019, I had a six-month internship in company Hcm Deck, where I was an intern as Junior Java Developer. I was responsible for developing microservices in Java Spring technology, as well as creating front-end components in React. It was there where I experienced for the first time developing a real front-end application.\n\n I graduated in june 2020 and my field of study was Computer Science. My major was information systems engineering. When I graduated I decided to do things which makes me feel the biggest joy in programming field, i.e. creating front-end applications, learnig about new technologies and functionalities thanks to which I will be able to improve my projects fuels my curiosity.",
  "projects": {
    "munchtrack": {
      "name": "Munchtrack",
      "description": "Service Munchtrack was created with a though to make munchkin card game to be easier to follow. Service makes it possible to register as a user and create a rooms to which other players can join. While in room, players can save thier character progress and follow opponents progress."
    },
    "portfolio": {
      "name": "Portfolio",
      "description": "Portfolio was made with intend to imporve my skills in creating responsive static websites, as well as better presentation of information about me, as a developer, in a form other than a CV"
    },
    "ethoLottery": {
      "name": "EthoLottery",
      "description": "EthoLottery is a website which operates in ethereum test network called Rinkeby. It is a simple one page lottery website, where ether is used as currency. Ether here has no real value, it is only used in test network as test currency. For website to work properly chrome plugin called MetaMask is needed, as well as creating account in ethereum network and connecting it with MetaMask plugin."
    },
    "toDoList": {
      "name": "To Do List",
      "description": "To Do List is a website in which you can save your daily tasks. Tasks are saved in browser memory, so you can leave and come back whenever you want, and your tasks will be right there, where you left them."
    },
    "titles": {
      "description": "Description",
      "technologies": "Technologies and libraries"
    },
    "backButton": "Back",
    "imageButton": "Images",
    "details": "Details"
  },
  "technologies": {
    "title": "Skills and technologies",
    "skillName": {
      "dataBase": "Database"
    },
    "skillDescriptions": {
      "html": "Knowledge of html document structure, the ability to use semantic and non-semantic tags.",
      "css": "The ability to create responsive websites, smooth transitions, creative in creating and good knowledge of flex-box'u.",
      "javaScript": "Knowledge of JavaScript mechanisms, as well as ES6 functionalities.",
      "react": "Creating react applications, communicating with api using Axios. Knowledge of React-Hooks, external libraries such as React-Redux, React-Router, Material-Ui, i18next, which makes internationalization possible and styling components using classic Css as well as Css-in-Js",
      "scrum": "Half a year of experience from working in a scrum team, in which o had occasion to learn scrum methodology. I can fit in well with the team and i'm not afraid to expierence and learn new things.",
      "git": "Basic ability to use Distributed Version Control System. Half a year of experience from working on commercial projects.",
      "java": "Ability to develop software with a use of Java programing language. Creating back-end software with a use of Spring-Boot framework as well as testing application with spock framework.",
      "dataBase": "Knowledge of relative database MySql, as well as basic skill of using MySql Workbench."
    }
  }
}